import React from 'react';
import '../styles/Login.css';

function handleScroll(e, setDisabled) {
  if (
    Math.floor(e.target.scrollHeight - e.target.scrollTop) <=
      e.target.clientHeight + 15 &&
    Math.floor(e.target.scrollHeight - e.target.scrollTop) >=
      e.target.clientHeight - 15
  ) {
    setDisabled(false);
  } else {
    setDisabled(true);
  }
}

export default function Policy({ setAgree, dialog, register }) {
  const [disabled, setDisabled] = React.useState(true);
  return (
    <div className='policy-text'>
      <div
        style={{ overflowY: 'scroll', maxHeight: '450px' }}
        onScroll={(e) => handleScroll(e, setDisabled)}
      >
        <h6 name='licenseAgreement'>
          นโยบายความเป็นส่วนตัวหรือนโยบายคุ้มครองข้อมูลส่วนบุคคลเป็นสัญญาอย่างหนึ่ง&nbsp;โดยมีคู่สัญญาฝ่ายหนึ่งคือผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชัน
          <br />
          ซึ่งเป็นผู้เก็บรวบรวม&nbsp;ใช้เปิดเผยข้อมูลส่วนบุคคลของคู่สัญญาอีกฝ่ายหนึ่งซึ่งเรียกว่าผู้ใช้งานเว็บไซต์หรือแอปพลิเคชันซึ่งเข้ามาใช้บริการในเว็บไซต์หรือแอปพลิเคชันนั้น&nbsp;โดยเนื้อหาในสัญญาจะกล่าวถึงสิทธิและหน้าที่ของคู่สัญญาแต่ละฝ่ายเกี่ยวกับการให้ข้อมูล
          &nbsp;การเก็บรวบรวมข้อมูล&nbsp; การใช้ข้อมูล&nbsp;
          รวมถึงการเผยแพร่ข้อมูลของผู้ใช้งานเว็บไซต์หรือแอปพลิเคชัน
          <br />
          โดยที่ข้อมูลส่วนบุคคลของผู้ใช้งาน &nbsp;ได้แก่
          &nbsp;ข้อมูลที่สามารถระบุตัวบุคคลซึ่งเป็นเจ้าของข้อมูลนั้นได้
          &nbsp;ไม่ว่าจะเป็นข้อมูลส่วนบุคคลทั่วไป&nbsp; เช่น&nbsp; ชื่อ&nbsp;
          นามสกุล&nbsp; ที่อยู่&nbsp; วันเดือนปีเกิด&nbsp; เบอร์โทรศัพท์&nbsp;
          อายุ&nbsp; วุฒิการศึกษา&nbsp; งานที่ทำ&nbsp;
          หรือข้อมูลส่วนบุคคลที่มีความอ่อนไหว (Sensitive Data)&nbsp; เช่น
          &nbsp;เชื้อชาติ &nbsp;เผ่าพันธ์ุ&nbsp; ความคิดเห็นทางการเมือง
          &nbsp;ความเชื่อ&nbsp; (ลัทธิ&nbsp; ศาสนา&nbsp; ปรัชญา)
          &nbsp;พฤติกรรมทางเพศ&nbsp; ประวัติอาชญากรรม&nbsp; สุขภาพ&nbsp;
          ความพิการ&nbsp; พันธุกรรม&nbsp; ข้อมูลชีวภาพ&nbsp;
          ข้อมูลภาพจำลองใบหน้า&nbsp; ม่านตา&nbsp; หรือลายนิ้วมือ&nbsp;
          สหภาพแรงงานของผู้ใช้งาน
          <br />
          ทั้งนี้&nbsp; ข้อกำหนดเงื่อนไขต่างๆ&nbsp;
          ที่กำหนดในนโยบายคุ้มครองข้อมูลส่วนบุคคล (เช่น&nbsp;
          การได้รับความยินยอมจากผู้ใช้งานในการเก็บรวบรวม&nbsp; ใช้
          และ&nbsp;หรือเผยแพร่ข้อมูลส่วนบุคคลของผู้ใช้งาน)
          จะต้องสอดคล้องและไม่ขัดต่อกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          ในทางกลับกันอาจกล่าวได้ว่าผู้ให้บริการหรือเจ้าของมักจัดทำนโยบายคุ้มครองข้อมูลส่วนบุคคลเพื่อให้การเก็บรวบรวม
          ใช้ เปิดเผยข้อมูลนั้นถูกต้องและเป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          <br />
          การนำไปใช้
          <br />
          ในการจัดทำนโยบายความเป็นส่วนตัวหรือนโยบายคุ้มครองข้อมูลส่วนบุคคล
          ผู้จัดทำควรพิจารณาดังต่อไปนี้&nbsp; ระบุ&nbsp; สิทธิ&nbsp;
          หน้าที่&nbsp; และความรับผิดชอบต่างๆ
          ระหว่างผู้ให้บริการหรือเจ้าของกับผู้ใช้งานเว็บไซต์หรือแอปพลิเคชัน
          รวมถึงข้อมูลต่าง&nbsp;ๆ
          เกี่ยวกับความเป็นส่วนตัวที่ผู้ใช้งานควรทราบ&nbsp; เช่น&nbsp;
          ข้อมูลของผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชัน&nbsp;
          สถานที่ตั้ง&nbsp; ช่องทางการติดต่อสอบถาม&nbsp; การร้องเรียน&nbsp;
          และแจ้งปัญหา&nbsp; การโฆษณาประชาสัมพันธ์&nbsp;
          การควบคุมการใช้งานโดยผู้ปกครอง (Parental&nbsp; Control)
          &nbsp;การใช้คุกกี้ (Cookies)&nbsp; เป็นต้น
          <br />
          ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันควรจัดให้ผู้ใช้งานสามารถเข้าถึงนโยบายความเป็นส่วนตัวนี้ได้โดยง่ายและเปิดเผยไว้ที่หน้าแรกของเว็บไซต์หรือแอปพลิเคชัน
          นอกจากนี้ยังควรให้ผู้ใช้งานอ่านและตอบยอมรับนโยบายความเป็นส่วนตัวของเว็บไซต์หรือแอปพลิเคชันก่อนการใช้งานครั้งแรกด้วยเพื่อเป็นการแสดงถึงความยินยอมและความตกลงที่จะยอมรับปฏิบัติตามเงื่อนไขของนโยบายความเป็นส่วนตัวโดยชัดแจ้ง
          ในกรณีที่ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันต้องการกำหนดเงื่อนไขการใช้งานเว็บไซต์หรือแอปพลิเคชันโดยละเอียด&nbsp;
          เช่น&nbsp; ระเบียบ &nbsp;ข้อกำจัดการใช้งาน&nbsp;
          เงื่อนไขการเป็นสมาชิก&nbsp; เงื่อนไขการขาย&nbsp;
          หรือให้บริการผ่านเว็บไซต์หรือแอปพลิเคชัน
          <br />
          ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันอาจจัดให้มีข้อกำหนดและเงื่อนไขการใช้เว็บไซต์&nbsp;แอปพลิเคชัน
          ควบคู่ไปพร้อมกันกับนโยบายความเป็นส่วนตัวนี้ด้วยก็ได้
          ในกรณีนี้ข้อกำหนดและเงื่อนไขการใช้เว็บไซต์&nbsp;แอปพลิเคชันดังกล่าวควรจะสอดคล้องและไม่มีข้อความหรือเงื่อนไขที่ขัดแย้งกัน
          <br />
          ข้อควรคำนึงตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          <br />
          ในกรณีที่ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันมีการเก็บรวบรวม
          ใช้&nbsp;
          หรือเผยแพร่ข้อมูลส่วนบุคคลของผู้ใช้งานตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันซึ่งเก็บรวบรวม&nbsp; ใช้
          และ/หรือเผยแพร่ข้อมูลส่วนบุคลลจะถือว่าเป็น&nbsp; ผู้ควบคุมข้อมูล
          ซึ่งจะมีหน้าที่ตามกฎหมายดังกล่าว&nbsp; เช่น&nbsp;
          ผู้ควบคุมข้อมูลต้องได้รับความยินยอมอย่างชัดแจ้งจากผู้ใช้งานเว็บไซต์หรือแอปพลิเคชันซึ่งเป็นเจ้าของข้อมูลนั้นก่อนจะเก็บรวบรวม
          ใช้&nbsp; หรือเผยแพร่ข้อมูลดังกล่าว
          โดยความยินยอมนั้นจะต้องระบุข้อมูลสำคัญในการขอความยินยอมนั้นด้วย&nbsp;
          เช่น วัตถุประสงค์การนำข้อมูลไปใช้&nbsp; ระยะเวลาในการเก็บรวบรวมข้อมูล
          <br />
          หน่วยงานที่อาจได้รับการเปิดเผยข้อมูล
          <br />
          สิทธิของเจ้าของข้อมูลที่มีต่อผู้ให้บริการเกี่ยวกับข้อมูลส่วนบุคคลที่เก็บรวบรวม
          ทั้งนี้&nbsp; ในการให้ความยินยอมของบุคคลที่มีความบกพร่องทางความสามารถ
          (เช่น ผู้เยาว์&nbsp; คนไร้ความสามารถ&nbsp; หรือคนเสมือนไร้ความสามารถ)
          ผู้ใช้อำนาจปกครองบุคคลเหล่านั้นจะต้องเป็นผู้ให้ความยินยอมแทนผู้ใช้งานผู้เป็นเจ้าของข้อมูลด้วย&nbsp;
          เช่น&nbsp; ผู้ปกครอง&nbsp; ผู้อนุบาล&nbsp;
          หรือผู้พิทักษ์แล้วแต่กรณีด้วย
          ผู้ควบคุมข้อมูลต้องดำเนินการซึ่งเป็นหน้าที่ต่างๆ
          ของผู้ควบคุมข้อมูลที่สอดคล้องกับกฎหมายคุ้มครองข้อมูลส่วนบุคคล&nbsp;
          เช่น&nbsp;
          จัดให้ผู้ใช้งานเจ้าของข้อมูลสามารถถอนความยินยอมได้ง่ายและได้รับข้อมูลเพียงพอในการถอนความยินยอม
          การแจ้งข้อมูลผลกระทบสำคัญต่อเจ้าของข้อมูล&nbsp; จัดให้มีวิธี&nbsp;
          มาตรการ&nbsp; มาตรฐาน&nbsp;
          หรือระบบเพื่อรักษาความมั่นคงปลอดภัยของข้อมูลที่เหมาะสม
          จัดให้มีการแก้ไขปรับปรุงข้อมูลให้เป็นปัจจุบันและ&nbsp;หรือที่ถูกต้อง&nbsp;
          ลบ&nbsp; ทำลายข้อมูลที่เกินระยะเวลาเก็บรวบรวมหรือที่ไม่เกี่ยวข้อง
          บันทึกรายการสำคัญเกี่ยวกับการจัดเก็บ&nbsp; การใช้&nbsp;
          หรือการเปิดเผยข้อมูลเพื่อการตรวจสอบจากผู้ใช้งานเจ้าของข้อมูลหรือจากหน่วยงานของรัฐ
          จัดให้มีเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลเพื่อปฏิบัติหน้าที่ตามที่กฎหมายกำหนดในกรณีที่มีการดำเนินกิจกรรมที่เข้าเงื่อนไขของกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          และหน้าที่อื่นๆ&nbsp; ตามกฎหมายดังกล่าว
          ผู้ควบคุมข้อมูลต้องจัดให้มีการดำเนินการและมีมาตรการของพนักงานผู้ที่มีส่วนเกี่ยวข้องกับการเก็บรวบรวม
          ใช้&nbsp;
          หรือเผยแพร่ข้อมูลเพื่อให้มีการดำเนินการที่สอดคล้องและเป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลด้วย
          ในกรณีที่มีการให้ข้อมูลแก่บุคคลอื่น&nbsp; เช่น&nbsp;
          ผู้ประมวลผลข้อมูลหรือบุคคลภายนอก
          จะต้องมีมาตรการควบคุมไม่ให้บุคคลอื่นนั้นใช้ข้อมูลที่ไม่เป็นไปตามกฎหมายด้วย
          และในกรณีที่มีการส่งข้อมูลออกไปนอกประเทศจะต้องมั่นใจว่าผู้รับข้อมูลนั้นมีมาตรการคุ้มครองความปลอดภัยของข้อมูลที่ไม่ด้อยไปกว่ามาตรฐานที่กำหนดในประเทศไทย&nbsp;
          อนึ่ง&nbsp;
          หากผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันไม่ปฏิบัติตามกฎหมายดังกล่าว
          อาจมีโทษทั้งทางแพ่ง (เช่น&nbsp;
          ชดใช้ค่าเสียหายและค่าเสียหายเชิงลงโทษแก่เจ้าของข้อมูลที่ได้รับความเสียหาย)
          โทษทางอาญา (เช่น&nbsp; จำคุก&nbsp; ปรับ) และโทษทางปกครอง (เช่น&nbsp;
          สั่งให้ดำเนินการแก้ไข&nbsp; ตักเตือน&nbsp; หรือปรับ)
          <br />
          กฎหมายที่เกี่ยวข้อง
          <br />
          พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
          <br />
          กฎหมายคุ้มครองข้อมูลส่วนบุคคลของสหภาพยุโรป&nbsp; หรือ&nbsp;
          European&nbsp; Union&nbsp; General&nbsp; Data&nbsp; Protection&nbsp;
          Regulation (GDPR)&nbsp;
          ในกรณีที่เว็บไซต์หรือแอปพลิเคชันมีการให้บริการหรือเสนอขายสินค้าแก่บุคคลธรรมดาซึ่งอยู่ในสหภาพยุโรปหรือมีการเก็บข้อมูลพฤติกรรมของผู้ใช้งานซึ่งอยู่ในสหภาพยุโรป
          <br />
          พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์
          <br />
          ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันอาจใช้แนวปฏิบัติที่ปรากฏในประกาศคณะกรรมการธุรกรรมทางอิเล็กทรอนิกส์
          เรื่อง
          แนวนโยบายและแนวปฏิบัติในการคุ้มครองข้อมูลส่วนบุคคลของหน่วยงานของรัฐ
          เป็นแนวทางเบื้องต้นในการพิจารณา <br />
          ความช่วยเหลือจากทนายความ
          <br />
          คุณสามารถเลือกที่จะปรึกษาทนายความได้ในกรณีที่คุณต้องการความช่วยเหลือ
          ทนายความสามารถช่วยคุณได้โดยทำการตอบคำถามของคุณหรือให้ความช่วยเหลือในกระบวนการต่าง
          ๆ จะมีการเสนอตัวเลือกดังกล่าวไว้ให้คุณในตอนท้ายของเอกสาร
        </h6>
      </div>
      <button
        type='button'
        disabled={disabled ? true : false}
        id='agree'
        onClick={register}
      >
        I Agreed
      </button>
    </div>
  );
}
